src/xml/request/getOrderStatus.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ofo="http://oss.dbc.dk/ns/openfindorder">
   <soapenv:Header/>
   <soapenv:Body>
      <ofo:getOrderStatusRequest>
         <!--Optional:-->
         <ofo:authentication>
            <ofo:groupIdAut>?</ofo:groupIdAut>
            <ofo:passwordAut>?</ofo:passwordAut>
            <ofo:userIdAut>?</ofo:userIdAut>
         </ofo:authentication>
         <!--You have a CHOICE of the next 2 items at this level-->
         <!--1 or more repetitions:-->
         <ofo:requesterAgencyId>?</ofo:requesterAgencyId>
         <!--1 or more repetitions:-->
         <ofo:responderAgencyId>?</ofo:responderAgencyId>
         <ofo:orderId>?</ofo:orderId>
         <ofo:agency>?</ofo:agency>
         <!--Optional:-->
         <ofo:fromDate>?</ofo:fromDate>
         <!--Optional:-->
         <ofo:toDate>?</ofo:toDate>
         <!--Optional:-->
         <ofo:lastModification>?</ofo:lastModification>
         <!--Optional:-->
         <ofo:outputType>?</ofo:outputType>
         <!--Optional:-->
         <ofo:callback>?</ofo:callback>
         <!--Optional:-->
         <ofo:sortKey>?</ofo:sortKey>
         <!--Optional:-->
         <ofo:start>?</ofo:start>
         <!--Optional:-->
         <ofo:stepValue>?</ofo:stepValue>
      </ofo:getOrderStatusRequest>
   </soapenv:Body>
</soapenv:Envelope>
